src/Documents/итУстановкаГрафикаИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>итУстановкаГрафикаИнвентаризации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.итГрафикИнвентаризации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СплошнаяЛокальная</Name>
					<Comment>0 - Сплошная, 1 - Локальная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетСлужбаСБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетСлужбаКРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>итФильтрыЛИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ИерархияАльтернативная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикИнвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДетализацияГрафика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Локальная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СБ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КРО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаТоваров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ИерархияАльтернативная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/итУстановкаГрафикаИнвентаризации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Период.ДатаНачала    = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;

	ЗаполнитьПоУмолчаниюПриСоздании();
	
	//Элементы.Календарь.НачалоПериодаОтображения	= Период.ДатаНачала;
	//Элементы.Календарь.КонецПериодаОтображения	= Период.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПриСоздании()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекПользователь    			 = ПараметрыСеанса.ТекущийПользователь;
		Объект.Организация 			 = ТекПользователь.Организация;
		Объект.ПодразделениеКомпании = ТекПользователь.ПодразделениеКомпании;
		Объект.Ответственный         = ТекПользователь;
			
		Период.ДатаНачала    = НачалоГода(ТекущаяДата());
		Период.ДатаОкончания = КонецГода(ТекущаяДата());		
		
		Объект.ДатаНачала 	 = Период.ДатаНачала;
		Объект.ДатаОкончания = Период.ДатаОкончания;
			
	КонецЕсли;
	
	Для Каждого стрПодразделение Из Объект.Подразделения Цикл
		Подразделения.Добавить(стрПодразделение.ПодразделениеКомпании);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПриСоздании1()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекПользователь    			 = ПараметрыСеанса.ТекущийПользователь;
		Объект.Организация 			 = ТекПользователь.Организация;
		Объект.ПодразделениеКомпании = ТекПользователь.ПодразделениеКомпании;
		Объект.Ответственный         = ТекПользователь;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|	И СкладыКомпании.ПодразделениеКомпании = &Подразделение";
		
		Запрос.УстановитьПараметр("Подразделение", ТекПользователь.ПодразделениеКомпании);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.СкладКомпании = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
		Период.ДатаНачала    = НачалоГода(ТекущаяДата());
		Период.ДатаОкончания = КонецГода(ТекущаяДата());		
		
		Объект.ДатаНачала 	 = Период.ДатаНачала;
		Объект.ДатаОкончания = Период.ДатаОкончания;
			
	КонецЕсли;

	Для Каждого стрГрафик Из Объект.ГрафикИнвентаризации Цикл
		ТаблицаРегистра.Добавить(стрГрафик.Дата);			
	КонецЦикла;
	
	Для Каждого стрГруппа Из Объект.итФильтрыЛИ Цикл
		ГруппаТоваров.Добавить(стрГруппа.Группа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	ТаблицаРегистра.Очистить();
	
	Сутки				 	= 86400;	
	ПоследнееВоскресение 	= Дата(1,1,1);
	ПоследнийМесяц       	= Дата(1,1,1);	
	ДатаСчетчик          	= Период.ДатаНачала - Сутки;	
	
	Пока ДатаСчетчик <=  Период.ДатаОкончания Цикл
		
		ДатаСчетчик = ДатаСчетчик + Сутки;
		
		счПоследнийМесяц   = НачалоМесяца(ДатаСчетчик);
		Если Не ЗначениеЗаполнено(ПоследнийМесяц) Тогда
			ПоследнийМесяц = счПоследнийМесяц;
		ИначеЕсли ПоследнийМесяц <> счПоследнийМесяц Тогда
			
			ПоследнийМесяцЧисло = Месяц(ПоследнийМесяц);
			//исключение последние две недели года, тоесть если месяц декабрь, то пропускаем
			Если ПоследнийМесяцЧисло <> 12 Тогда 
				ТаблицаРегистра.Добавить(ПоследнееВоскресение);					
			КонецЕсли;	
			
			ПоследнийМесяц      = счПоследнийМесяц;
		
		КонецЕсли;	
		
		Если ДеньНедели(ДатаСчетчик) = 7 Тогда			
			ПоследнееВоскресение = ДатаСчетчик;
		КонецЕсли;		
		
	КонецЦикла;
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ДетализацияГрафика.Очистить();
	
	Для Каждого стрПодразделение Из Подразделения Цикл
		Для Каждого стрГрафика   Из ТаблицаРегистра Цикл
			
			НоваяСтрока = Об.ДетализацияГрафика.Добавить();
			НоваяСтрока.Дата = стрГрафика.Значение;
			НоваяСтрока.Подразделение = стрПодразделение.Значение;
			
		КонецЦикла;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период установки графика. Заполнение не выполнено.");
	КонецЕсли;	
	
	Если Подразделения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выбраных подразделений. Заполнение не выполнено.");		
	КонецЕсли;
	
	ЗаполнитьПоУмолчаниюНаСервере();
	
	//Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	//ТаблицаРегистра.Очистить();
	//
	//Элементы.Календарь.НачалоПериодаОтображения	= Период.ДатаНачала;
	//Элементы.Календарь.КонецПериодаОтображения	= Период.ДатаОкончания;
	
	Объект.ДатаНачала 	 = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	//Элементы.Календарь.Обновить();
	
КонецПроцедуры

// Процедура - обработчик события "ПриВыводеПериода" элемента формы "Календарь"
//
&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	
	Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		СтрокаТаблицыРегистра = ТаблицаРегистра.НайтиПоЗначению(СтрокаОформленияПериода.Дата);
		
		Если СтрокаТаблицыРегистра = Неопределено Тогда
			//СтрокаОформленияПериода.ЦветТекста = WebЦвета.Красный;
			СтрокаОформленияПериода.ЦветФона = WebЦвета.Белый;
			
		Иначе
			//СтрокаОформленияПериода.ЦветТекста = WebЦвета.Черный;
			СтрокаОформленияПериода.ЦветФона = WebЦвета.Оранжевый;

		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	
	МассивДат 	  = Элемент.ВыделенныеДаты;
	
	Если МассивДат.Количество() Тогда
	
		ВыбраннаяДата = МассивДат[0];
			
		СтрокаТаблицыРегистра = ТаблицаРегистра.НайтиПоЗначению(ВыбраннаяДата);
		
		Если СтрокаТаблицыРегистра = Неопределено Тогда
			ТаблицаРегистра.Добавить(ВыбраннаяДата);
		Иначе
			ТаблицаРегистра.Удалить(СтрокаТаблицыРегистра);
		КонецЕсли;
		
		Если Не Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
		
		Элемент.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Объект.ГрафикИнвентаризации.Очистить();
	//Для Каждого стрГрафика Из ТаблицаРегистра Цикл		
	//	НовСтр = Объект.ГрафикИнвентаризации.Добавить();
	//	НовСтр.Дата = стрГрафика.Значение;	
	//КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Календарь.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ГруппаТоваровПриИзменении(Элемент)
	
	//Объект.итФильтрыЛИ.Очистить();
	//Для Каждого стрГруппа Из ГруппаТоваров Цикл
	//	НовСтр = Объект.итФильтрыЛИ.Добавить();
	//	НовСтр.Группа = стрГруппа.Значение;
	//КонецЦикла;
			
КонецПроцедуры


&НаКлиенте
Процедура ПодразделенияПриИзменении(Элемент)
	
	Объект.Подразделения.Очистить();
	Для Каждого стрПодразделение Из Подразделения Цикл
		НовСтр = Объект.Подразделения.Добавить();
		НовСтр.ПодразделениеКомпании = стрПодразделение.Значение;
	КонецЦикла;

КонецПроцедуры
